podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV40F15.h
/* RCM - Peripheral instance base addresses */
#define RCM_BasePtr                    0x4007F000UL //!< Peripheral base address
#define RCM                            ((RCM_Type *) RCM_BasePtr) //!< Freescale base pointer
#define RCM_BASE_PTR                   (RCM) //!< Freescale style base pointer
/**
 * @} */ /* End group RCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SIM_Peripheral_access_layer_GROUP SIM Peripheral Access Layer
* @brief C Struct for SIM
* @{
*/

/* ================================================================================ */
/* ================           SIM (file:SIM_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief System Integration Module
 */
/**
* @addtogroup SIM_structs_GROUP SIM struct
* @brief Struct for SIM
* @{
*/
typedef struct {                                /*       SIM Structure                                                */
   __IO uint32_t  SOPT1;                        /**< 0000: System Options Register 1                                    */
   __I  uint32_t  RESERVED0[1024];             
   __IO uint32_t  SOPT2;                        /**< 1004: System Options Register 2                                    */
   __I  uint32_t  RESERVED1;                   
   __IO uint32_t  SOPT4;                        /**< 100C: System Options Register 4                                    */
   __IO uint32_t  SOPT5;                        /**< 1010: System Options Register 5                                    */
   __I  uint32_t  RESERVED2;                   
   __IO uint32_t  SOPT7;                        /**< 1018: System Options Register 7                                    */
   __IO uint32_t  SOPT8;                        /**< 101C: System Options Register 8                                    */
   __IO uint32_t  SOPT9;                        /**< 1020: System Options Register 9                                    */
   __I  uint32_t  SDID;                         /**< 1024: System Device Identification Register                        */
   __I  uint32_t  RESERVED3[3];                
   __IO uint32_t  SCGC4;                        /**< 1034: System Clock Gating Control Register 4                       */
   __IO uint32_t  SCGC5;                        /**< 1038: System Clock Gating Control Register 5                       */
   __IO uint32_t  SCGC6;                        /**< 103C: System Clock Gating Control Register 6                       */
   __IO uint32_t  SCGC7;                        /**< 1040: System Clock Gating Control Register 7                       */
   __IO uint32_t  CLKDIV1;                      /**< 1044: System Clock Divider Register 1                              */
   __I  uint32_t  RESERVED4;                   
   __IO uint32_t  FCFG1;                        /**< 104C: Flash Configuration Register 1                               */
   __I  uint32_t  FCFG2;                        /**< 1050: Flash Configuration Register 2                               */
   __I  uint32_t  UIDH;                         /**< 1054: Unique Identification Register High                          */
   __I  uint32_t  UIDMH;                        /**< 1058: Unique Identification Register Mid-High                      */
   __I  uint32_t  UIDML;                        /**< 105C: Unique Identification Register Mid Low                       */
   __I  uint32_t  UIDL;                         /**< 1060: Unique Identification Register Low                           */
   __I  uint32_t  RESERVED5;                   
   __IO uint32_t  CLKDIV4;                      /**< 1068: System Clock Divider Register 4                              */
   __IO uint32_t  MISCTRL;                      /**< 106C: Miscellaneous Control Register                               */
   __IO uint32_t  MISCTRL2;                     /**< 1070: Miscellaneous Control Register 2                             */
   __I  uint32_t  RESERVED6[35];               
   __IO uint32_t  WDOGC;                        /**< 1100: WDOG Control Register                                        */
   __IO uint32_t  PWRC;                         /**< 1104: Power Control Register                                       */
   __IO uint32_t  ADCOPT;                       /**< 1108: ADC Channel 6/7 Mux Control Register                         */
} SIM_Type;

/**
 * @} */ /* End group SIM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SIM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup SIM_Register_Masks_GROUP SIM Register Masks
* @brief Register Masks for SIM
* @{
*/
/* ------- SOPT1 Bit Fields                         ------ */
#define SIM_SOPT1_RAMSIZE_MASK                   (0x0FUL << SIM_SOPT1_RAMSIZE_SHIFT)                 /*!< SIM_SOPT1: RAMSIZE Mask                 */
#define SIM_SOPT1_RAMSIZE_SHIFT                  12                                                  /*!< SIM_SOPT1: RAMSIZE Position             */
#define SIM_SOPT1_RAMSIZE(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_RAMSIZE_SHIFT))&SIM_SOPT1_RAMSIZE_MASK) /*!< SIM_SOPT1                               */
#define SIM_SOPT1_OSC32KSEL_MASK                 (0x03UL << SIM_SOPT1_OSC32KSEL_SHIFT)               /*!< SIM_SOPT1: OSC32KSEL Mask               */
#define SIM_SOPT1_OSC32KSEL_SHIFT                18                                                  /*!< SIM_SOPT1: OSC32KSEL Position           */
#define SIM_SOPT1_OSC32KSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK) /*!< SIM_SOPT1                               */
/* ------- SOPT2 Bit Fields                         ------ */
#define SIM_SOPT2_CLKOUTSEL_MASK                 (0x07UL << SIM_SOPT2_CLKOUTSEL_SHIFT)               /*!< SIM_SOPT2: CLKOUTSEL Mask               */
#define SIM_SOPT2_CLKOUTSEL_SHIFT                5                                                   /*!< SIM_SOPT2: CLKOUTSEL Position           */
#define SIM_SOPT2_CLKOUTSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_CLKOUTSEL_SHIFT))&SIM_SOPT2_CLKOUTSEL_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_TRACECLKSEL_MASK               (0x01UL << SIM_SOPT2_TRACECLKSEL_SHIFT)             /*!< SIM_SOPT2: TRACECLKSEL Mask             */
#define SIM_SOPT2_TRACECLKSEL_SHIFT              12                                                  /*!< SIM_SOPT2: TRACECLKSEL Position         */
#define SIM_SOPT2_NANOEDGECLK2XSEL_MASK          (0x01UL << SIM_SOPT2_NANOEDGECLK2XSEL_SHIFT)        /*!< SIM_SOPT2: NANOEDGECLK2XSEL Mask        */
#define SIM_SOPT2_NANOEDGECLK2XSEL_SHIFT         31                                                  /*!< SIM_SOPT2: NANOEDGECLK2XSEL Position    */
/* ------- SOPT4 Bit Fields                         ------ */
#define SIM_SOPT4_FTM0FLT0_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT0_SHIFT)                /*!< SIM_SOPT4: FTM0FLT0 Mask                */
#define SIM_SOPT4_FTM0FLT0_SHIFT                 0                                                   /*!< SIM_SOPT4: FTM0FLT0 Position            */
#define SIM_SOPT4_FTM0FLT1_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT1_SHIFT)                /*!< SIM_SOPT4: FTM0FLT1 Mask                */
#define SIM_SOPT4_FTM0FLT1_SHIFT                 1                                                   /*!< SIM_SOPT4: FTM0FLT1 Position            */
#define SIM_SOPT4_FTM0FLT2_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT2_SHIFT)                /*!< SIM_SOPT4: FTM0FLT2 Mask                */
#define SIM_SOPT4_FTM0FLT2_SHIFT                 2                                                   /*!< SIM_SOPT4: FTM0FLT2 Position            */
#define SIM_SOPT4_FTM0FLT3_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT3_SHIFT)                /*!< SIM_SOPT4: FTM0FLT3 Mask                */
#define SIM_SOPT4_FTM0FLT3_SHIFT                 3                                                   /*!< SIM_SOPT4: FTM0FLT3 Position            */
#define SIM_SOPT4_FTM1FLT0_MASK                  (0x01UL << SIM_SOPT4_FTM1FLT0_SHIFT)                /*!< SIM_SOPT4: FTM1FLT0 Mask                */
#define SIM_SOPT4_FTM1FLT0_SHIFT                 4                                                   /*!< SIM_SOPT4: FTM1FLT0 Position            */
#define SIM_SOPT4_FTM3FLT0_MASK                  (0x01UL << SIM_SOPT4_FTM3FLT0_SHIFT)                /*!< SIM_SOPT4: FTM3FLT0 Mask                */
#define SIM_SOPT4_FTM3FLT0_SHIFT                 12                                                  /*!< SIM_SOPT4: FTM3FLT0 Position            */
#define SIM_SOPT4_FTM0TRG0SRC_MASK               (0x01UL << SIM_SOPT4_FTM0TRG0SRC_SHIFT)             /*!< SIM_SOPT4: FTM0TRG0SRC Mask             */
#define SIM_SOPT4_FTM0TRG0SRC_SHIFT              16                                                  /*!< SIM_SOPT4: FTM0TRG0SRC Position         */
#define SIM_SOPT4_FTM0TRG1SRC_MASK               (0x01UL << SIM_SOPT4_FTM0TRG1SRC_SHIFT)             /*!< SIM_SOPT4: FTM0TRG1SRC Mask             */
#define SIM_SOPT4_FTM0TRG1SRC_SHIFT              17                                                  /*!< SIM_SOPT4: FTM0TRG1SRC Position         */
#define SIM_SOPT4_FTM0TRG2SRC_MASK               (0x01UL << SIM_SOPT4_FTM0TRG2SRC_SHIFT)             /*!< SIM_SOPT4: FTM0TRG2SRC Mask             */
#define SIM_SOPT4_FTM0TRG2SRC_SHIFT              18                                                  /*!< SIM_SOPT4: FTM0TRG2SRC Position         */
#define SIM_SOPT4_FTM1TRG0SRC_MASK               (0x01UL << SIM_SOPT4_FTM1TRG0SRC_SHIFT)             /*!< SIM_SOPT4: FTM1TRG0SRC Mask             */
#define SIM_SOPT4_FTM1TRG0SRC_SHIFT              20                                                  /*!< SIM_SOPT4: FTM1TRG0SRC Position         */
#define SIM_SOPT4_FTM1TRG2SRC_MASK               (0x01UL << SIM_SOPT4_FTM1TRG2SRC_SHIFT)             /*!< SIM_SOPT4: FTM1TRG2SRC Mask             */
#define SIM_SOPT4_FTM1TRG2SRC_SHIFT              22                                                  /*!< SIM_SOPT4: FTM1TRG2SRC Position         */
#define SIM_SOPT4_FTM3TRG0SRC_MASK               (0x01UL << SIM_SOPT4_FTM3TRG0SRC_SHIFT)             /*!< SIM_SOPT4: FTM3TRG0SRC Mask             */
#define SIM_SOPT4_FTM3TRG0SRC_SHIFT              28                                                  /*!< SIM_SOPT4: FTM3TRG0SRC Position         */
#define SIM_SOPT4_FTM3TRG1SRC_MASK               (0x01UL << SIM_SOPT4_FTM3TRG1SRC_SHIFT)             /*!< SIM_SOPT4: FTM3TRG1SRC Mask             */
#define SIM_SOPT4_FTM3TRG1SRC_SHIFT              29                                                  /*!< SIM_SOPT4: FTM3TRG1SRC Position         */
#define SIM_SOPT4_FTM3TRG2SRC_MASK               (0x01UL << SIM_SOPT4_FTM3TRG2SRC_SHIFT)             /*!< SIM_SOPT4: FTM3TRG2SRC Mask             */
#define SIM_SOPT4_FTM3TRG2SRC_SHIFT              30                                                  /*!< SIM_SOPT4: FTM3TRG2SRC Position         */
/* ------- SOPT5 Bit Fields                         ------ */
#define SIM_SOPT5_UART0TXSRC_MASK                (0x01UL << SIM_SOPT5_UART0TXSRC_SHIFT)              /*!< SIM_SOPT5: UART0TXSRC Mask              */
#define SIM_SOPT5_UART0TXSRC_SHIFT               0                                                   /*!< SIM_SOPT5: UART0TXSRC Position          */
#define SIM_SOPT5_UART0RXSRC_MASK                (0x03UL << SIM_SOPT5_UART0RXSRC_SHIFT)              /*!< SIM_SOPT5: UART0RXSRC Mask              */
#define SIM_SOPT5_UART0RXSRC_SHIFT               2                                                   /*!< SIM_SOPT5: UART0RXSRC Position          */
#define SIM_SOPT5_UART0RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0RXSRC_SHIFT))&SIM_SOPT5_UART0RXSRC_MASK) /*!< SIM_SOPT5                               */
#define SIM_SOPT5_UART1TXSRC_MASK                (0x01UL << SIM_SOPT5_UART1TXSRC_SHIFT)              /*!< SIM_SOPT5: UART1TXSRC Mask              */
#define SIM_SOPT5_UART1TXSRC_SHIFT               4                                                   /*!< SIM_SOPT5: UART1TXSRC Position          */
#define SIM_SOPT5_UART1RXSRC_MASK                (0x03UL << SIM_SOPT5_UART1RXSRC_SHIFT)              /*!< SIM_SOPT5: UART1RXSRC Mask              */
#define SIM_SOPT5_UART1RXSRC_SHIFT               6                                                   /*!< SIM_SOPT5: UART1RXSRC Position          */
#define SIM_SOPT5_UART1RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1RXSRC_SHIFT))&SIM_SOPT5_UART1RXSRC_MASK) /*!< SIM_SOPT5                               */
/* ------- SOPT7 Bit Fields                         ------ */
#define SIM_SOPT7_ADCATRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADCATRGSEL_SHIFT)              /*!< SIM_SOPT7: ADCATRGSEL Mask              */
#define SIM_SOPT7_ADCATRGSEL_SHIFT               0                                                   /*!< SIM_SOPT7: ADCATRGSEL Position          */
#define SIM_SOPT7_ADCATRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADCATRGSEL_SHIFT))&SIM_SOPT7_ADCATRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADCAALTTRGEN_MASK              (0x03UL << SIM_SOPT7_ADCAALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADCAALTTRGEN Mask            */
#define SIM_SOPT7_ADCAALTTRGEN_SHIFT             6                                                   /*!< SIM_SOPT7: ADCAALTTRGEN Position        */
#define SIM_SOPT7_ADCAALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADCAALTTRGEN_SHIFT))&SIM_SOPT7_ADCAALTTRGEN_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADCBTRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADCBTRGSEL_SHIFT)              /*!< SIM_SOPT7: ADCBTRGSEL Mask              */
#define SIM_SOPT7_ADCBTRGSEL_SHIFT               8                                                   /*!< SIM_SOPT7: ADCBTRGSEL Position          */
#define SIM_SOPT7_ADCBTRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADCBTRGSEL_SHIFT))&SIM_SOPT7_ADCBTRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADCBALTTRGEN_MASK              (0x03UL << SIM_SOPT7_ADCBALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADCBALTTRGEN Mask            */
#define SIM_SOPT7_ADCBALTTRGEN_SHIFT             14                                                  /*!< SIM_SOPT7: ADCBALTTRGEN Position        */
#define SIM_SOPT7_ADCBALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADCBALTTRGEN_SHIFT))&SIM_SOPT7_ADCBALTTRGEN_MASK) /*!< SIM_SOPT7                               */
/* ------- SOPT8 Bit Fields                         ------ */
#define SIM_SOPT8_FTM0SYNCBIT_MASK               (0x01UL << SIM_SOPT8_FTM0SYNCBIT_SHIFT)             /*!< SIM_SOPT8: FTM0SYNCBIT Mask             */
#define SIM_SOPT8_FTM0SYNCBIT_SHIFT              0                                                   /*!< SIM_SOPT8: FTM0SYNCBIT Position         */
#define SIM_SOPT8_FTM1SYNCBIT_MASK               (0x01UL << SIM_SOPT8_FTM1SYNCBIT_SHIFT)             /*!< SIM_SOPT8: FTM1SYNCBIT Mask             */
#define SIM_SOPT8_FTM1SYNCBIT_SHIFT              1                                                   /*!< SIM_SOPT8: FTM1SYNCBIT Position         */
#define SIM_SOPT8_FTM3SYNCBIT_MASK               (0x01UL << SIM_SOPT8_FTM3SYNCBIT_SHIFT)             /*!< SIM_SOPT8: FTM3SYNCBIT Mask             */
#define SIM_SOPT8_FTM3SYNCBIT_SHIFT              3                                                   /*!< SIM_SOPT8: FTM3SYNCBIT Position         */
#define SIM_SOPT8_FTM0CFSEL_MASK                 (0x01UL << SIM_SOPT8_FTM0CFSEL_SHIFT)               /*!< SIM_SOPT8: FTM0CFSEL Mask               */
#define SIM_SOPT8_FTM0CFSEL_SHIFT                8                                                   /*!< SIM_SOPT8: FTM0CFSEL Position           */
#define SIM_SOPT8_FTM3CFSEL_MASK                 (0x01UL << SIM_SOPT8_FTM3CFSEL_SHIFT)               /*!< SIM_SOPT8: FTM3CFSEL Mask               */
#define SIM_SOPT8_FTM3CFSEL_SHIFT                9                                                   /*!< SIM_SOPT8: FTM3CFSEL Position           */
#define SIM_SOPT8_FTM0OCH0SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH0SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH0SRC Mask             */
#define SIM_SOPT8_FTM0OCH0SRC_SHIFT              16                                                  /*!< SIM_SOPT8: FTM0OCH0SRC Position         */
#define SIM_SOPT8_FTM0OCH1SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH1SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH1SRC Mask             */
#define SIM_SOPT8_FTM0OCH1SRC_SHIFT              17                                                  /*!< SIM_SOPT8: FTM0OCH1SRC Position         */
#define SIM_SOPT8_FTM0OCH2SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH2SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH2SRC Mask             */
#define SIM_SOPT8_FTM0OCH2SRC_SHIFT              18                                                  /*!< SIM_SOPT8: FTM0OCH2SRC Position         */
#define SIM_SOPT8_FTM0OCH3SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH3SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH3SRC Mask             */
#define SIM_SOPT8_FTM0OCH3SRC_SHIFT              19                                                  /*!< SIM_SOPT8: FTM0OCH3SRC Position         */
#define SIM_SOPT8_FTM0OCH4SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH4SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH4SRC Mask             */
#define SIM_SOPT8_FTM0OCH4SRC_SHIFT              20                                                  /*!< SIM_SOPT8: FTM0OCH4SRC Position         */
#define SIM_SOPT8_FTM0OCH5SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH5SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH5SRC Mask             */
#define SIM_SOPT8_FTM0OCH5SRC_SHIFT              21                                                  /*!< SIM_SOPT8: FTM0OCH5SRC Position         */
#define SIM_SOPT8_FTM0OCH6SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH6SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH6SRC Mask             */
#define SIM_SOPT8_FTM0OCH6SRC_SHIFT              22                                                  /*!< SIM_SOPT8: FTM0OCH6SRC Position         */
#define SIM_SOPT8_FTM0OCH7SRC_MASK               (0x01UL << SIM_SOPT8_FTM0OCH7SRC_SHIFT)             /*!< SIM_SOPT8: FTM0OCH7SRC Mask             */
#define SIM_SOPT8_FTM0OCH7SRC_SHIFT              23                                                  /*!< SIM_SOPT8: FTM0OCH7SRC Position         */
#define SIM_SOPT8_FTM3OCH0SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH0SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH0SRC Mask             */
#define SIM_SOPT8_FTM3OCH0SRC_SHIFT              24                                                  /*!< SIM_SOPT8: FTM3OCH0SRC Position         */
#define SIM_SOPT8_FTM3OCH1SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH1SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH1SRC Mask             */
#define SIM_SOPT8_FTM3OCH1SRC_SHIFT              25                                                  /*!< SIM_SOPT8: FTM3OCH1SRC Position         */
#define SIM_SOPT8_FTM3OCH2SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH2SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH2SRC Mask             */
#define SIM_SOPT8_FTM3OCH2SRC_SHIFT              26                                                  /*!< SIM_SOPT8: FTM3OCH2SRC Position         */
#define SIM_SOPT8_FTM3OCH3SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH3SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH3SRC Mask             */
#define SIM_SOPT8_FTM3OCH3SRC_SHIFT              27                                                  /*!< SIM_SOPT8: FTM3OCH3SRC Position         */
#define SIM_SOPT8_FTM3OCH4SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH4SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH4SRC Mask             */
#define SIM_SOPT8_FTM3OCH4SRC_SHIFT              28                                                  /*!< SIM_SOPT8: FTM3OCH4SRC Position         */
#define SIM_SOPT8_FTM3OCH5SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH5SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH5SRC Mask             */
#define SIM_SOPT8_FTM3OCH5SRC_SHIFT              29                                                  /*!< SIM_SOPT8: FTM3OCH5SRC Position         */
#define SIM_SOPT8_FTM3OCH6SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH6SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH6SRC Mask             */
#define SIM_SOPT8_FTM3OCH6SRC_SHIFT              30                                                  /*!< SIM_SOPT8: FTM3OCH6SRC Position         */
#define SIM_SOPT8_FTM3OCH7SRC_MASK               (0x01UL << SIM_SOPT8_FTM3OCH7SRC_SHIFT)             /*!< SIM_SOPT8: FTM3OCH7SRC Mask             */
#define SIM_SOPT8_FTM3OCH7SRC_SHIFT              31                                                  /*!< SIM_SOPT8: FTM3OCH7SRC Position         */
/* ------- SOPT9 Bit Fields                         ------ */
#define SIM_SOPT9_FTM1ICH0SRC_MASK               (0x03UL << SIM_SOPT9_FTM1ICH0SRC_SHIFT)             /*!< SIM_SOPT9: FTM1ICH0SRC Mask             */
#define SIM_SOPT9_FTM1ICH0SRC_SHIFT              4                                                   /*!< SIM_SOPT9: FTM1ICH0SRC Position         */
#define SIM_SOPT9_FTM1ICH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM1ICH0SRC_SHIFT))&SIM_SOPT9_FTM1ICH0SRC_MASK) /*!< SIM_SOPT9                               */
#define SIM_SOPT9_FTM1ICH1SRC_MASK               (0x01UL << SIM_SOPT9_FTM1ICH1SRC_SHIFT)             /*!< SIM_SOPT9: FTM1ICH1SRC Mask             */
#define SIM_SOPT9_FTM1ICH1SRC_SHIFT              6                                                   /*!< SIM_SOPT9: FTM1ICH1SRC Position         */
#define SIM_SOPT9_FTM0CLKSEL_MASK                (0x03UL << SIM_SOPT9_FTM0CLKSEL_SHIFT)              /*!< SIM_SOPT9: FTM0CLKSEL Mask              */
#define SIM_SOPT9_FTM0CLKSEL_SHIFT               24                                                  /*!< SIM_SOPT9: FTM0CLKSEL Position          */
#define SIM_SOPT9_FTM0CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM0CLKSEL_SHIFT))&SIM_SOPT9_FTM0CLKSEL_MASK) /*!< SIM_SOPT9                               */
#define SIM_SOPT9_FTM1CLKSEL_MASK                (0x03UL << SIM_SOPT9_FTM1CLKSEL_SHIFT)              /*!< SIM_SOPT9: FTM1CLKSEL Mask              */
#define SIM_SOPT9_FTM1CLKSEL_SHIFT               26                                                  /*!< SIM_SOPT9: FTM1CLKSEL Position          */
#define SIM_SOPT9_FTM1CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM1CLKSEL_SHIFT))&SIM_SOPT9_FTM1CLKSEL_MASK) /*!< SIM_SOPT9                               */
#define SIM_SOPT9_FTM3CLKSEL_MASK                (0x03UL << SIM_SOPT9_FTM3CLKSEL_SHIFT)              /*!< SIM_SOPT9: FTM3CLKSEL Mask              */
#define SIM_SOPT9_FTM3CLKSEL_SHIFT               30                                                  /*!< SIM_SOPT9: FTM3CLKSEL Position          */
#define SIM_SOPT9_FTM3CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3CLKSEL_SHIFT))&SIM_SOPT9_FTM3CLKSEL_MASK) /*!< SIM_SOPT9                               */
/* ------- SDID Bit Fields                          ------ */
#define SIM_SDID_PINID_MASK                      (0x0FUL << SIM_SDID_PINID_SHIFT)                    /*!< SIM_SDID: PINID Mask                    */
#define SIM_SDID_PINID_SHIFT                     0                                                   /*!< SIM_SDID: PINID Position                */
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_PINID_SHIFT))&SIM_SDID_PINID_MASK) /*!< SIM_SDID                                */
